import React from 'react';
import styles from './ArticleContent.module.css';

const ArticleContent = () => {
    return (
        <article className={styles.articleContent}>

            <div className={styles.textContainer}>
                <h3 className={styles.articleSubtitle}>
                    Додаток 1<br />
                    до Протоколу НР за № 9/2023/НР/П від 07.08.2023 р.<br /><br />
                    Повідомлення про дистанційне проведення<br />
                    позачергових Загальних зборів акціонерів<br />
                    ПРИВАТНОГО АКЦІОНЕРНОГО ТОВАРИСТВА<br />
                    «РОКИТНІВСЬКИЙ СКЛЯНИЙ ЗАВОД»<br />
                    по скороченій процедурі їх скликання
                </h3>
                <section className={styles.mainContent}>
                    <p><strong>ПРИВАТНЕ АКЦІОНЕРНЕ ТОВАРИСТВО «РОКИТНІВСЬКИЙ СКЛЯНИЙ ЗАВОД» (код ЄДРПОУ 00293462, місцезнаходження: </strong>
                        34200, Рівненська область, Сарненський район, смт.Рокитне, вул. Патріотична, будинок 18 (далі – Товариство) повідомляє про скликання та дистанційне проведення позачергових Загальних зборів акціонерів Товариства по скороченій процедурі їх скликання (далі – Загальні збори). Рішення про скликання Загальних зборів та їх дистанційне проведення прийняте Наглядовою радою Товариства (Протокол № 9/2023/НР/П від 07.08.2023 р). Загальні збори відбуватимуться дистанційно, відповідно до вимог «Порядку скликання та проведення дистанційних загальних зборів акціонерів », затвердженого рішенням НКЦПФР за № 236 від 06.03.2023 року ( далі – Порядок ).
                    </p>
                    <p><strong>28.08.2023 року</strong> – дата проведення Загальних зборів (дата завершення голосування).</p>
                    <p>На дату складення переліку акціонерів Товариства, яким надсилається повідомлення про проведення Загальних зборів, загальна кількість простих іменних акцій у випуску становить 11 390 517 шт., у. т.ч. голосуючих акцій – 11 257 694 шт.</p>
                    <p><strong>22.08.2023 року</strong> ( станом на 24-00 годину )- дата складення переліку акціонерів, які мають право на участь у Загальних зборах.</p>
                    <p>22.08.2023 року – дата розміщення бюлетенів для голосування у вільному для акціонерів доступі на власному веб-сайті Товариства https://rsz.com.ua у розділі «Акціонерам»</p>
                </section>
                <section className={styles.agenda}>
                    <h4 className={styles.agendaTitle}>Перелік питань разом з проектами рішень (крім кумулятивного голосування) щодо кожного з питань, включених до порядку денного:</h4>
                    <ol className={styles.agendaList}>
                        <li>Про попереднє надання згоди на вчинення значних правочинів, які можуть вчинятися Товариством з Акціонерним банком «Південний», протягом одного року з дати прийняття відповідного рішення та надання повноважень Генеральному директору на підписання правочинів з Публічним акціонерним товариством Акціонерний банк "Південний" (ідентифікаційний код юридичної особи 20953647).</li>
                    </ol>
                </section>
            </div>

            <div className={styles.readMore}>
                <img src="https://cdn.builder.io/api/v1/image/assets/TEMP/f67dbe4720412a4b4421aa63e65c35ac93ef5d6d62e83440d61d5ff01f295213?placeholderIfAbsent=true&apiKey=4de2176252d24e8ebcd3e8166c772c27" alt="" className={styles.decorativeImage} />
            </div>
        </article>
    );
};

export default ArticleContent;