import React from 'react';
import ArticleCard from './ArticleCard';
import styles from './ArticleList.module.css';

const articles = [
    {
        title: 'Публічна безвідклична пропозиція (оферта) про придбання акцій ПРАТ «РОКИТНІВСЬКИЙ СКЛЯНИЙ ЗАВОД»',
        date: '20.10.2023',
        content: 'На виконання вимог п. 4 Статті 93 . Розділу XI ІІ ЗУ «Про Акціонерні товариства» (№2465-IX від 27.07.2022 р.) ПРИВАТНЕ АКЦІОНЕРНЕ ТОВАРИСТВО «РОКИТНІВСЬКИЙ СКЛЯНИЙ ЗАВОД» (ідентифікаційний код 00293462, місцезнаходження: Україна, Рівненська область,Сарненський район, смт. Рокитне, вул.Патріотична, 18, надалі – Товариство), повідомляє про отримання 20.10.2023 р. від ТОВ «КУА «ГРОШІ ТА КАПІТАЛ» (Код ЄДПРОУ: 37954084) , що діє в інтересах АТ ЗНВКІФ «КАПІТАЛ ГРУП КОМПАНІ» (Код ЄДПРОУ: 45058993), публічної безвідкличної пропозиції (оферти) для акціонерів – власників простих іменних акцій Товариства про придбання належних їм акцій, яка розміщена на власних веб-сайтах Товариства, а саме: https://rsz.com.ua та http://00293462.infosite.com.ua',
        url: "/shareholders/test",
    },
    {
        title: 'Відомості про набуття прямо або опосередковано особою (особами, що діють спільно) з урахуванням кількості акцій, які належать їй та її афілійованим особам, контрольного пакета акцій Товариства',
        date: '29.09.2023',
        content: 'ПРАТ "РОКИТНІВСЬКИЙ СКЛЯНИЙ ЗАВОД" ( далі за текстом – Товариство) повідомляє, що 29.09.2023 року отримало від акціонера Товариства Акціонерного товариства "ЗАКРИТОГО НЕДИВЕРСИФІКОВАНОГО ВЕНЧУРНОГО КОРПОРАТИВНОГО ІНВЕСТИЦІЙНОГО ФОНДУ "КАПІТАЛ ГРУП КОМПАНІ" ( скорочена назва: АТ "ЗНВКІФ "КАПІТАЛ ГРУП КОМПАНІ") (код ЄДРПОУ: 45058993; код ЄДРІСІ: 13301479),в інтересах якого діє Товариство з обмеженою відповідальністю "КОМПАНІЯ З УПРАВЛІННЯ АКТИВАМИ "ГРОШІ ТА КАПІТАЛ" (код ЄДРПОУ 37954084), відомості щодо набуття АТ "ЗНВКІФ "КАПІТАЛ ГРУП КОМПАНІ" контрольного пакета акцій Товариства. Розмір частки АТ "ЗНВКІФ "КАПІТАЛ ГРУП КОМПАНІ" в загальній кількості акцій Товариства до набуття становив 0%, після набуття – 67, 465% в загальній кількості акцій і 84,506 % в загальній кількості голосуючих акцій.',
        url: "/shareholders/test",
    },
];

const ArticleList = () => {
    return (
        <div className={styles.articleList}>
            {articles.map((article, index) => (
                <ArticleCard key={index} {...article} />
            ))}
        </div>
    );
};

export default ArticleList;